In [1]:
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns
import numpy as np

%matplotlib inline

In [2]:
df_demo = pd.read_csv('../data/raw/df_final_demo.txt',sep=',')  # copy path

In [3]:
df_demo.head()

,client_id,clnt_tenure_yr,clnt_tenure_mnth,clnt_age,gendr,num_accts,bal,calls_6_mnth,logons_6_mnth
0,836976,6.0,73.0,60.5,U,2.0,45105.30,6.0,9.0
1,2304905,7.0,94.0,58.0,U,2.0,110860.30,6.0,9.0
2,1439522,5.0,64.0,32.0,U,2.0,52467.79,6.0,9.0
3,1562045,16.0,198.0,49.0,M,2.0,67454.65,3.0,6.0
4,5126305,12.0,145.0,33.0,F,2.0,103671.75,0.0,3.0

In [4]:

print(df_demo.dtypes)

client_id             int64
clnt_tenure_yr      float64
clnt_tenure_mnth    float64
clnt_age            float64
gendr                object
num_accts           float64
bal                 float64
calls_6_mnth        float64
logons_6_mnth       float64
dtype: object

In [5]:
df_web_data_1 = pd.read_csv('../data/raw/df_final_web_data_pt_1.txt', sep=',')
df_web_data_1.head()

,client_id,visitor_id,visit_id,process_step,date_time
0,9988021,580560515_7732621733,781255054_21935453173_531117,step_3,2017-04-17 15:27:07
1,9988021,580560515_7732621733,781255054_21935453173_531117,step_2,2017-04-17 15:26:51
2,9988021,580560515_7732621733,781255054_21935453173_531117,step_3,2017-04-17 15:19:22
3,9988021,580560515_7732621733,781255054_21935453173_531117,step_2,2017-04-17 15:19:13
4,9988021,580560515_7732621733,781255054_21935453173_531117,step_3,2017-04-17 15:18:04

In [6]:
df_web_data_2 = pd.read_csv('../data/raw/df_final_web_data_pt_2.txt', sep=',')
df_web_data_2.head()

,client_id,visitor_id,visit_id,process_step,date_time
0,763412,601952081_10457207388,397475557_40440946728_419634,confirm,2017-06-06 08:56:00
1,6019349,442094451_91531546617,154620534_35331068705_522317,confirm,2017-06-01 11:59:27
2,6019349,442094451_91531546617,154620534_35331068705_522317,step_3,2017-06-01 11:58:48
3,6019349,442094451_91531546617,154620534_35331068705_522317,step_2,2017-06-01 11:58:08
4,6019349,442094451_91531546617,154620534_35331068705_522317,step_1,2017-06-01 11:57:58

In [7]:
df_experiment_clients = pd.read_csv('../data/raw/df_final_experiment_clients.txt', sep=',')
df_experiment_clients.head()

   client_id Variation
0    9988021      Test
1    8320017      Test
2    4033851   Control
3    1982004      Test
4    9294070   Control

# Data Cleaning: df_final_demo. txt

In [8]:
df_demo.head()

,client_id,clnt_tenure_yr,clnt_tenure_mnth,clnt_age,gendr,num_accts,bal,calls_6_mnth,logons_6_mnth
0,836976,6.0,73.0,60.5,U,2.0,45105.30,6.0,9.0
1,2304905,7.0,94.0,58.0,U,2.0,110860.30,6.0,9.0
2,1439522,5.0,64.0,32.0,U,2.0,52467.79,6.0,9.0
3,1562045,16.0,198.0,49.0,M,2.0,67454.65,3.0,6.0
4,5126305,12.0,145.0,33.0,F,2.0,103671.75,0.0,3.0

In [9]:

# Fill NaN with zeros otherwise it gives a error 
df_demo['clnt_tenure_yr'] = df_demo['clnt_tenure_yr'].fillna(0).astype(int)
print (df_demo['clnt_tenure_yr'])

0         6
1         7
2         5
3        16
4        12
         ..
70604     4
70605    12
70606    16
70607    21
70608    21
Name: clnt_tenure_yr, Length: 70609, dtype: int64

In [10]:
df_demo['clnt_tenure_mnth'] = df_demo['clnt_tenure_mnth'].fillna(0).astype(int)
print (df_demo['clnt_tenure_mnth'])

0         73
1         94
2         64
3        198
4        145
        ...
70604     56
70605    148
70606    198
70607    255
70608    254
Name: clnt_tenure_mnth, Length: 70609, dtype: int64

In [11]:
df_demo['clnt_age'] = df_demo['clnt_age'].fillna(0).astype(int)
print (df_demo['clnt_age'])

0        60
1        58
2        32
3        49
4        33
         ..
70604    38
70605    31
70606    61
70607    68
70608    59
Name: clnt_age, Length: 70609, dtype: int64

In [12]:
df_demo['calls_6_mnth'] = df_demo['calls_6_mnth'].fillna(0).astype(int)
print (df_demo['calls_6_mnth'])

0        6
1        6
2        6
3        3
4        0
        ..
70604    5
70605    6
70606    3
70607    4
70608    7
Name: calls_6_mnth, Length: 70609, dtype: int64

In [13]:
df_demo['logons_6_mnth'] = df_demo['logons_6_mnth'].fillna(0).astype(int)
print (df_demo['logons_6_mnth'])

0        9
1        9
2        9
3        6
4        3
        ..
70604    5
70605    6
70606    3
70607    4
70608    7
Name: logons_6_mnth, Length: 70609, dtype: int64

In [14]:
df_demo['num_accts'] = df_demo['num_accts'].fillna(0).astype(int)
print (df_demo['num_accts'])

0        2
1        2
2        2
3        2
4        2
        ..
70604    3
70605    2
70606    2
70607    3
70608    3
Name: num_accts, Length: 70609, dtype: int64

In [15]:
df_demo['gendr'].unique()

array(['U', 'M', 'F', nan, 'X'], dtype=object)

In [16]:

# Define a categorizing method
gender_map = {
    'M': 'Male',
    'F': 'Female',
    'U': 'Unknown',
    'X': 'Non-binary', 
}


df_demo['gendr'] = df_demo['gendr'].replace(gender_map).fillna('Unknown')

print(df_demo)

       client_id  clnt_tenure_yr  clnt_tenure_mnth  clnt_age    gendr  \
0         836976               6                73        60  Unknown
1        2304905               7                94        58  Unknown
2        1439522               5                64        32  Unknown
3        1562045              16               198        49     Male
4        5126305              12               145        33   Female
...          ...             ...               ...       ...      ...
70604    7993686               4                56        38  Unknown
70605    8981690              12               148        31     Male
70606     333913              16               198        61   Female
70607    1573142              21               255        68     Male
70608    5602139              21               254        59   Female

       num_accts         bal  calls_6_mnth  logons_6_mnth
0              2    45105.30             6              9
1              2   110860.30             6              9
2              2    52467.79             6              9
3              2    67454.65             3              6
4              2   103671.75             0              3
...          ...         ...           ...            ...
70604          3  1411062.68             5              5
70605          2   101867.07             6              6
70606          2    40745.00             3              3
70607          3   475114.69             4              4
70608          3   157498.73             7              7

[70609 rows x 9 columns]

In [17]:
#generate csv file 
df_demo.to_csv('final_demo_cleaned.csv', index=False)  # i want to read csv